Ran Plan for dir: `ECS_EC2` workspace: `default`

<details><summary>Show Output</summary>

```diff
data.template_file.ecs-task-container: Reading...
data.template_file.ecs-task-container: Read complete after 0s [id=7a6cacb1a7b4e466baa6efc0b4c7caee64d6ee495d49677bdc6948219771b73a]
data.aws_availability_zones.available: Reading...
data.aws_iam_policy_document.ecs_task_execution_role: Reading...
data.aws_availability_zones.all: Reading...
data.aws_iam_policy_document.ecs_task_execution_role: Read complete after 0s [id=1903849331]
data.aws_availability_zones.all: Read complete after 1s [id=eu-west-1]
data.aws_availability_zones.available: Read complete after 1s [id=eu-west-1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_alb.alb will be created
+ resource "aws_alb" "alb" {
      + arn                        = (known after apply)
      + arn_suffix                 = (known after apply)
      + desync_mitigation_mode     = "defensive"
      + dns_name                   = (known after apply)
      + drop_invalid_header_fields = false
      + enable_deletion_protection = false
      + enable_http2               = true
      + enable_waf_fail_open       = false
      + id                         = (known after apply)
      + idle_timeout               = 60
      + internal                   = false
      + ip_address_type            = (known after apply)
      + load_balancer_type         = "application"
      + name                       = "orangutancluster-load-balancer"
      + security_groups            = (known after apply)
      + subnets                    = (known after apply)
      + tags_all                   = (known after apply)
      + vpc_id                     = (known after apply)
      + zone_id                    = (known after apply)

      + subnet_mapping {
          + allocation_id        = (known after apply)
          + ipv6_address         = (known after apply)
          + outpost_id           = (known after apply)
          + private_ipv4_address = (known after apply)
          + subnet_id            = (known after apply)
        }
    }

  # aws_alb_listener.alb_listener will be created
+ resource "aws_alb_listener" "alb_listener" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 5000
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # aws_alb_target_group.alb-tg will be created
+ resource "aws_alb_target_group" "alb-tg" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + name                               = "orangutancluster-alb-tg"
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = (known after apply)
      + target_type                        = "instance"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 30
          + matcher             = "200"
          + path                = "/"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 3
          + unhealthy_threshold = 2
        }

      + stickiness {
          + cookie_duration = (known after apply)
          + cookie_name     = (known after apply)
          + enabled         = (known after apply)
          + type            = (known after apply)
        }
    }

  # aws_api_gateway_deployment.api_deployment will be created
+ resource "aws_api_gateway_deployment" "api_deployment" {
      + created_date  = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = (known after apply)
      + triggers      = (known after apply)
    }

  # aws_api_gateway_rest_api.orangutan_api will be created
+ resource "aws_api_gateway_rest_api" "orangutan_api" {
      + api_key_source               = (known after apply)
      + arn                          = (known after apply)
      + binary_media_types           = (known after apply)
      + body                         = (known after apply)
      + created_date                 = (known after apply)
      + description                  = "OrangutanCluster API Gateway"
      + disable_execute_api_endpoint = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + minimum_compression_size     = -1
      + name                         = "OrangutanCluster"
      + policy                       = (known after apply)
      + root_resource_id             = (known after apply)
      + tags_all                     = (known after apply)

      + endpoint_configuration {
          + types            = [
              + "REGIONAL",
            ]
          + vpc_endpoint_ids = (known after apply)
        }
    }

  # aws_api_gateway_stage.api_stage will be created
+ resource "aws_api_gateway_stage" "api_stage" {
      + arn           = (known after apply)
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = (known after apply)
      + stage_name    = "dev"
      + tags_all      = (known after apply)
    }

  # aws_autoscaling_group.ecs_autoscaling_group will be created
+ resource "aws_autoscaling_group" "ecs_autoscaling_group" {
      + arn                       = (known after apply)
      + availability_zones        = (known after apply)
      + default_cooldown          = (known after apply)
      + desired_capacity          = 1
      + force_delete              = false
      + force_delete_warm_pool    = false
      + health_check_grace_period = 300
      + health_check_type         = "EC2"
      + id                        = (known after apply)
      + launch_configuration      = "OrangutanCluster-launch-config"
      + max_size                  = 2
      + metrics_granularity       = "1Minute"
      + min_size                  = 1
      + name                      = "OrangutanCluster-autoSG"
      + name_prefix               = (known after apply)
      + protect_from_scale_in     = false
      + service_linked_role_arn   = (known after apply)
      + vpc_zone_identifier       = (known after apply)
      + wait_for_capacity_timeout = "10m"
    }

  # aws_autoscaling_policy.web_policy_down will be created
+ resource "aws_autoscaling_policy" "web_policy_down" {
      + adjustment_type         = "ChangeInCapacity"
      + arn                     = (known after apply)
      + autoscaling_group_name  = "OrangutanCluster-autoSG"
      + cooldown                = 300
      + id                      = (known after apply)
      + metric_aggregation_type = (known after apply)
      + name                    = "OrangutanCluster_policy_down"
      + policy_type             = "SimpleScaling"
      + scaling_adjustment      = -1
    }

  # aws_autoscaling_policy.web_policy_up will be created
+ resource "aws_autoscaling_policy" "web_policy_up" {
      + adjustment_type         = "ChangeInCapacity"
      + arn                     = (known after apply)
      + autoscaling_group_name  = "OrangutanCluster-autoSG"
      + cooldown                = 300
      + id                      = (known after apply)
      + metric_aggregation_type = (known after apply)
      + name                    = "OrangutanCluster-policy_up"
      + policy_type             = "SimpleScaling"
      + scaling_adjustment      = 1
    }

  # aws_cloudwatch_log_group.ecs_log_group will be created
+ resource "aws_cloudwatch_log_group" "ecs_log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/ecs/orangutancluster"
      + retention_in_days = 30
      + tags              = {
          + "Name" = "orangutancluster-cw-log-group"
        }
      + tags_all          = {
          + "Name" = "orangutancluster-cw-log-group"
        }
    }

  # aws_cloudwatch_log_stream.myapp_log_stream will be created
+ resource "aws_cloudwatch_log_stream" "myapp_log_stream" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + log_group_name = "/ecs/orangutancluster"
      + name           = "orangutancluster-log-stream"
    }

  # aws_cloudwatch_metric_alarm.web_cpu_alarm_down will be created
+ resource "aws_cloudwatch_metric_alarm" "web_cpu_alarm_down" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "This metric monitor EC2 instance CPU utilization"
      + alarm_name                            = "OrangutanCluster_cpu_alarm_down"
      + arn                                   = (known after apply)
      + comparison_operator                   = "LessThanOrEqualToThreshold"
      + dimensions                            = {
          + "AutoScalingGroupName" = "OrangutanCluster-autoSG"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "CPUUtilization"
      + namespace                             = "AWS/EC2"
      + period                                = 120
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 40
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.web_cpu_alarm_up will be created
+ resource "aws_cloudwatch_metric_alarm" "web_cpu_alarm_up" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "This metric monitor EC2 instance CPU utilization"
      + alarm_name                            = "OrangutanCluster_cpu_alarm_up"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = {
          + "AutoScalingGroupName" = "OrangutanCluster-autoSG"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "CPUUtilization"
      + namespace                             = "AWS/EC2"
      + period                                = 120
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 70
      + treat_missing_data                    = "missing"
    }

  # aws_ecs_cluster.ecs-ec2-cluster will be created
+ resource "aws_ecs_cluster" "ecs-ec2-cluster" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "OrangutanCluster"
      + tags_all = (known after apply)

      + setting {
          + name  = (known after apply)
          + value = (known after apply)
        }
    }

  # aws_ecs_service.test-service will be created
+ resource "aws_ecs_service" "test-service" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = (known after apply)
      + name                               = "orangutancluster-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "orangutancluster-container"
          + container_port   = 5000
          + target_group_arn = (known after apply)
        }

      + ordered_placement_strategy {
          + field = "instanceId"
          + type  = "spread"
        }
    }

  # aws_ecs_task_definition.ecs-task-definition will be created
+ resource "aws_ecs_task_definition" "ecs-task-definition" {
      + arn                   = (known after apply)
      + container_definitions = jsonencode(
            [
              + {
                  + command           = []
                  + entryPoint        = []
                  + environment       = []
                  + essential         = true
                  + image             = "rehanislam/orangutan:latest"
                  + links             = []
                  + logConfiguration  = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "/ecs/orangutancluster"
                          + awslogs-region        = "eu-west-1"
                          + awslogs-stream-prefix = "orangutancluster-container-log-stream"
                        }
                    }
                  + memoryReservation = 128
                  + name              = "orangutancluster-container"
                  + portMappings      = [
                      + {
                          + containerPort = 5000
                          + hostPort      = 0
                          + protocol      = "tcp"
                        },
                    ]
                  + volumesFrom       = []
                },
            ]
        )
      + family                = "orangutancluster-task"
      + id                    = (known after apply)
      + network_mode          = (known after apply)
      + revision              = (known after apply)
      + tags_all              = (known after apply)
    }

  # aws_iam_instance_profile.ecs_agent will be created
+ resource "aws_iam_instance_profile" "ecs_agent" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "ecs-agent"
      + path        = "/"
      + role        = "myECcsTaskExecutionRole"
      + tags_all    = (known after apply)
      + unique_id   = (known after apply)
    }

  # aws_iam_role.ecs_task_execution_role will be created
+ resource "aws_iam_role" "ecs_task_execution_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "myECcsTaskExecutionRole"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy_attachment.ecs_task_execution_role will be created
+ resource "aws_iam_role_policy_attachment" "ecs_task_execution_role" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonEC2ContainerServiceforEC2Role"
      + role       = "myECcsTaskExecutionRole"
    }

  # aws_internet_gateway.test-igw will be created
+ resource "aws_internet_gateway" "test-igw" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "OrangutanCluster-igw"
        }
      + tags_all = {
          + "Name" = "OrangutanCluster-igw"
        }
      + vpc_id   = (known after apply)
    }

  # aws_launch_configuration.ecs_launch_config will be created
+ resource "aws_launch_configuration" "ecs_launch_config" {
      + arn                         = (known after apply)
      + associate_public_ip_address = true
      + ebs_optimized               = (known after apply)
      + enable_monitoring           = true
      + iam_instance_profile        = "ecs-agent"
      + id                          = (known after apply)
      + image_id                    = "ami-06bb94c46ddc47feb"
      + instance_type               = "t2.micro"
      + key_name                    = "aws-key-pair"
      + name                        = "OrangutanCluster-launch-config"
      + name_prefix                 = (known after apply)
      + security_groups             = (known after apply)
      + user_data                   = "a06360864a5b6cb044898164fc21adbc56d653b9"

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + no_device             = (known after apply)
          + snapshot_id           = (known after apply)
          + throughput            = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + throughput            = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # aws_route.internet_access will be created
+ resource "aws_route" "internet_access" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # aws_security_group.alb-sg will be created
+ resource "aws_security_group" "alb-sg" {
      + arn                    = (known after apply)
      + description            = "controls access to the ALB"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 5000
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 5000
            },
        ]
      + name                   = "OrangutanCluster-load-balancer-security-group"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "OrangutanCluster-alb-sg"
        }
      + tags_all               = {
          + "Name" = "OrangutanCluster-alb-sg"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.ecs_sg will be created
+ resource "aws_security_group" "ecs_sg" {
      + arn                    = (known after apply)
      + description            = "allow inbound access from the ALB only"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 65535
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "OrangutanCluster-ecs-tasks-security-group"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "OrangutanCluster-ecs-sg"
        }
      + tags_all               = {
          + "Name" = "OrangutanCluster-ecs-sg"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_subnet.public[0] will be created
+ resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "OrangutanCluster-public-0"
        }
      + tags_all                                       = {
          + "Name" = "OrangutanCluster-public-0"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public[1] will be created
+ resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "OrangutanCluster-public-1"
        }
      + tags_all                                       = {
          + "Name" = "OrangutanCluster-public-1"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_vpc.my-vpc will be created
+ resource "aws_vpc" "my-vpc" {
      + arn                            = (known after apply)
      + cidr_block                     = "10.0.0.0/16"
      + default_network_acl_id         = (known after apply)
      + default_route_table_id         = (known after apply)
      + default_security_group_id      = (known after apply)
      + dhcp_options_id                = (known after apply)
      + enable_classiclink             = (known after apply)
      + enable_classiclink_dns_support = (known after apply)
      + enable_dns_hostnames           = true
      + enable_dns_support             = true
      + id                             = (known after apply)
      + instance_tenancy               = "default"
      + ipv6_association_id            = (known after apply)
      + ipv6_cidr_block                = (known after apply)
      + main_route_table_id            = (known after apply)
      + owner_id                       = (known after apply)
      + tags                           = {
          + "Name" = "OrangutanCluster-VPC"
        }
      + tags_all                       = {
          + "Name" = "OrangutanCluster-VPC"
        }
    }

Plan: 27 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ alb_hostname-output    = (known after apply)
+ api_gateway_invoke_url = (known after apply)

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d ECS_EC2`
* :put_litter_in_its_place: To **delete** this plan click [here](https://c8b4-182-191-91-183.in.ngrok.io/lock?id=atifcodenterprise%252Fcode%252FECS_EC2%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d ECS_EC2`
</details>
Plan: 27 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
